# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# REDIS Toolkit Messages Range CDIST2800 to  CDIST2899 

# TRNOTE - Do not translate:  REDIS, SQL, SPL
REDIS_PROPERTIES_NOT_EXIST=CDIST2800E \u0423\u043a\u0430\u0437\u0430\u043d\u043d\u044b\u0439 \u0444\u0430\u0439\u043b \u0441\u0432\u043e\u0439\u0441\u0442\u0432 REDIS \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442. \u0423\u043a\u0430\u0437\u0430\u043d \u0444\u0430\u0439\u043b '{0}' .
REDIS_CONNECTION_FAILED_ERROR=CDIST2801E \u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f REDIS. \u0418\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f - '{0}' .
REDIS_CLASS_NAME_NOT_EXIST=CDIST2802E \u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f redisClassName, \u0447\u0442\u043e\u0431\u044b \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 REDIS.
# TRNOTE - REDIS_CLASS_NAME_NOT_EXIST - Do not translate:  redisClassName
REDIS_URL_NOT_EXIST=CDIST2803E \u0422\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f ''redisUrl'', \u0447\u0442\u043e\u0431\u044b \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 REDIS.
REDIS_RESET_CONNECTION_FAILED=CDIST2804E \u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u0431\u0440\u043e\u0441\u0430 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f REDIS. \u0418\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f - '{0}' .
REDIS_STATEMENT_PARAMETER_NOT_EXIST=CDIST2805E \u0410\u0442\u0440\u0438\u0431\u0443\u0442, \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u0430, \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442: '{0}' .
REDIS_SPL_TYPE_NOT_SUPPORT=CDIST2806E \u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u044d\u0442\u043e\u0442 \u0442\u0438\u043f SPL: '{0}' 
REDIS_SQL_STATEMENT_NULL=CDIST2807E \u041f\u0443\u0441\u0442\u043e\u0439 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 SQL.
REDIS_SQL_EXCEPTION_ERROR=CDIST2808E \u0412\u043e\u0437\u043d\u0438\u043a\u043b\u0430 \u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f SQL. \u0418\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f - '{0}' .
REDIS_REC_BOUND_NEG=CDIST2809E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 reconnectionBound \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u0431\u043e\u043b\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u043e \u043d\u0443\u043b\u044f.
REDIS_REC_BOUND_NOT_ALLOWED=CDIST2810E reconnectionBound \u043f\u043e\u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f, \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0434\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 reconnectionPolicy \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 BoundedRetry.
# TRNOTE - REDIS_REC_BOUND_NOT_ALLOWED - Do not translate:  reconnectionBound, reconnectionPolicy, BoundedRetry
REDIS_WRONG_CONTROLPORT_TYPE=CDIST2811E \u0423 \u043f\u043e\u0440\u0442\u0430 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0442\u0438\u043f\u0430 ''rstring'', \u0430 \u043d\u0430\u0439\u0434\u0435\u043d\u043e '{0}' 
# TRNOTE - REDIS_REC_BOUND_NOT_ALLOWED - Do not translate:  rstring
REDIS_ATMOST_TWO_ATTR=CDIST2812E \u0423 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u043e\u0448\u0438\u0431\u043e\u043a \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043d\u0435 \u0431\u043e\u043b\u0435\u0435 \u0434\u0432\u0443\u0445 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u043e\u0432.
REDIS_ATLEAST_ONE_ATTR=CDIST2813E \u0423 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0433\u043e \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u043f\u043e\u0440\u0442\u0430 \u043e\u0448\u0438\u0431\u043e\u043a \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u0445\u043e\u0442\u044f \u0431\u044b \u043e\u0434\u0438\u043d \u0430\u0442\u0440\u0438\u0431\u0443\u0442.
REDIS_ERROR_PORT_FIRST_ATTR_TUPLE=CDIST2814E \u041f\u0435\u0440\u0432\u044b\u0439 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u043d\u0430 \u043d\u0435\u043e\u0431\u044f\u0437\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u043c \u0432\u044b\u0445\u043e\u0434\u043d\u043e\u043c \u043f\u043e\u0440\u0442\u0443 \u043e\u0448\u0438\u0431\u043e\u043a \u0434\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043a\u043e\u0440\u0442\u0435\u0436\u0435\u043c. 
REDIS_HASRSATTR_NOT_EXIST=CDIST2815E \u0410\u0442\u0440\u0438\u0431\u0443\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 hasResultSetAttr, \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442: '{0}' .
REDIS_SQLSTATUSATTR_NOT_EXIST=CDIST2816E \u0410\u0442\u0440\u0438\u0431\u0443\u0442, \u0437\u0430\u0434\u0430\u043d\u043d\u044b\u0439 \u0432 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0435 sqlStatusAttr, \u043d\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442: '{0}' .
REDIS_NO_CONSISTENT_REGION=CDIST2817E \u041e\u043f\u0435\u0440\u0430\u0442\u043e\u0440 '{0}' \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043d\u0430\u0447\u0430\u043b\u043e\u043c \u043d\u0435\u043f\u0440\u043e\u0442\u0438\u0432\u043e\u0440\u0435\u0447\u0438\u0432\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438.
# TRNOTE - REDIS_NO_CONSISTENT_REGION - Do not translate:  consistent region
REDIS_REC_BOUND_NOT_ZERO=CDIST2818E \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 reconnectionBound '{0}' \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u0431\u043e\u043b\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u043e \u043d\u0443\u043b\u044e.  
REDIS_REC_BOUND_NOT_SET_RETRY=CDIST2819E reconnectionBound '{0}' \u043c\u043e\u0436\u0435\u0442 \u043f\u043e\u044f\u0432\u0438\u0442\u044c\u0441\u044f, \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0434\u043b\u044f \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u0430 reconnectionPolicy \u0437\u0430\u0434\u0430\u043d\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 BoundedRetry, \u0438 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u043f\u043e\u044f\u0432\u0438\u0442\u044c\u0441\u044f \u043d\u0438 \u0432 \u043a\u0430\u043a\u043e\u043c \u0434\u0440\u0443\u0433\u043e\u043c \u0441\u043b\u0443\u0447\u0430\u0435.
REDIS_CONNECTION_FAILED_WARNING=CDIST2820W \u041e\u0448\u0438\u0431\u043a\u0430 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f REDIS. \u0418\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f - '{0}' .
REDIS_SQL_EXCEPTION_WARNING=CDIST2821W \u0412\u043e\u0437\u043d\u0438\u043a\u043b\u0430 \u0438\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f SQL. \u0418\u0441\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u044c\u043d\u0430\u044f \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u044f - '{0}' .
REDIS_ATTEMPT_TO_RECONNECT=CDIST2822I \u041f\u043e\u043f\u044b\u0442\u043a\u0430 \u0432\u043e\u0441\u0441\u043e\u0437\u0434\u0430\u0442\u044c \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435 REDIS.
REDIS_CR_CLOSE=CDIST2823I \u0417\u0430\u043a\u0440\u044b\u0442\u0438\u0435 StateHandler.
REDIS_CR_CHECKPOINT=CDIST2824I \u041a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u0430\u044f \u0442\u043e\u0447\u043a\u0430. ID \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0438 '{0}' .
REDIS_CR_DRAIN=CDIST2825I \u041e\u043f\u0443\u0441\u0442\u043e\u0448\u0435\u043d\u0438\u0435.
REDIS_CR_RESET=CDIST2826I \u0421\u0431\u0440\u043e\u0441 \u043a \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0435: '{0}' 
# TRNOTE - REDIS_CR_RESET - Do not translate:  checkpoint
REDIS_RESET_TO_INITIAL=CDIST2827I \u0421\u0431\u0440\u043e\u0441 \u043a \u043d\u0430\u0447\u0430\u043b\u044c\u043d\u043e\u043c\u0443 \u0441\u043e\u0441\u0442\u043e\u044f\u043d\u0438\u044e.
REDIS_CR_RETIRE=CDIST2828I \u0410\u043d\u043d\u0443\u043b\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u043e\u0439 \u0442\u043e\u0447\u043a\u0438.
# TRNOTE - REDIS_CR_RETIRE - Do not translate:  checkpoint

