# NLS_MESSAGEFORMAT_ALL
# NLS_ENCODING=UNICODE
# REDIS Toolkit Messages Range CDIST2800 to  CDIST2899 

# TRNOTE - Do not translate:  REDIS, SQL, SPL
REDIS_PROPERTIES_NOT_EXIST=CDIST2800E El archivo de propiedades REDIS especificado no existe. El archivo especificado es '{0}'.
REDIS_CONNECTION_FAILED_ERROR=CDIST2801E La conexi\u00f3n REDIS ha fallado. La excepci\u00f3n es '{0}'
REDIS_CLASS_NAME_NOT_EXIST=CDIST2802E Se requiere redisClassName para crear una conexi\u00f3n REDIS.
# TRNOTE - REDIS_CLASS_NAME_NOT_EXIST - Do not translate:  redisClassName
REDIS_URL_NOT_EXIST=CDIST2803E Se requiere redisUrl para crear una conexi\u00f3n REDIS.
REDIS_RESET_CONNECTION_FAILED=CDIST2804E No se ha podido restablecer la conexi\u00f3n REDIS. La excepci\u00f3n es '{0}'.
REDIS_STATEMENT_PARAMETER_NOT_EXIST=CDIST2805E El atributo especificado en el par\u00e1metro de sentencia no existe: '{0}'.
REDIS_SPL_TYPE_NOT_SUPPORT=CDIST2806E El operador no da soporte a este tipo SPL: '{0}'
REDIS_SQL_STATEMENT_NULL=CDIST2807E La sentencia SQL est\u00e1 vac\u00eda.
REDIS_SQL_EXCEPTION_ERROR=CDIST2808E Se ha producido una excepci\u00f3n SQL. La excepci\u00f3n es '{0}'
REDIS_REC_BOUND_NEG=CDIST2809E El valor del par\u00e1metro reconnectionBound debe ser cero o mayor que cero.
REDIS_REC_BOUND_NOT_ALLOWED=CDIST2810E reconnectionBound aparece s\u00f3lo cuando el par\u00e1metro reconnectionPolicy est\u00e1 establecido en BoundedRetry.
# TRNOTE - REDIS_REC_BOUND_NOT_ALLOWED - Do not translate:  reconnectionBound, reconnectionPolicy, BoundedRetry
REDIS_WRONG_CONTROLPORT_TYPE=CDIST2811E El puerto de control debe tener un atributo de tipo ''rstring'', se ha encontrado '{0}'
# TRNOTE - REDIS_REC_BOUND_NOT_ALLOWED - Do not translate:  rstring
REDIS_ATMOST_TWO_ATTR=CDIST2812E El puerto de salida de error opcional no puede tener m\u00e1s de dos atributos.
REDIS_ATLEAST_ONE_ATTR=CDIST2813E El puerto de salida de error opcional debe tener como m\u00ednimo un atributo.
REDIS_ERROR_PORT_FIRST_ATTR_TUPLE=CDIST2814E El primer atributo en el puerto de salida de error opcional debe ser una tupla. 
REDIS_HASRSATTR_NOT_EXIST=CDIST2815E El atributo especificado en el par\u00e1metro hasResultSetAttr no existe: '{0}'.
REDIS_SQLSTATUSATTR_NOT_EXIST=CDIST2816E El atributo especificado en el par\u00e1metro sqlStatusAttr no existe: '{0}'
REDIS_NO_CONSISTENT_REGION=CDIST2817E El operador '{0}' no puede ser el inicio de una regi\u00f3n coherente.
# TRNOTE - REDIS_NO_CONSISTENT_REGION - Do not translate:  consistent region
REDIS_REC_BOUND_NOT_ZERO=CDIST2818E El valor de reconnectionBound {0} debe ser cero o mayor que cero 
REDIS_REC_BOUND_NOT_SET_RETRY=CDIST2819E reconnectionBound {0} puede aparecer s\u00f3lo cuando el par\u00e1metro reconnectionPolicy est\u00e1 establecido en BoundedRetry y no puede aparecer de otra forma. 
REDIS_CONNECTION_FAILED_WARNING=CDIST2820W La conexi\u00f3n REDIS ha fallado. La excepci\u00f3n es '{0}'
REDIS_SQL_EXCEPTION_WARNING=CDIST2821W Se ha producido una excepci\u00f3n SQL. La excepci\u00f3n es '{0}'.
REDIS_ATTEMPT_TO_RECONNECT=CDIST2822I Intentando volver a crear la conexi\u00f3n REDIS.
REDIS_CR_CLOSE=CDIST2823I StateHandler cerrado.
REDIS_CR_CHECKPOINT=CDIST2824I Comprobaci\u00f3n. El ID de comprobaci\u00f3n es '{0}'.
REDIS_CR_DRAIN=CDIST2825I Drenar.
REDIS_CR_RESET=CDIST2826I Restablecer a comprobaci\u00f3n: '{0}' 
# TRNOTE - REDIS_CR_RESET - Do not translate:  checkpoint
REDIS_RESET_TO_INITIAL=CDIST2827I Restablecer a estado inicial.
REDIS_CR_RETIRE=CDIST2828I Retirar comprobaci\u00f3n.
# TRNOTE - REDIS_CR_RETIRE - Do not translate:  checkpoint

